Twist/Twist-TAS/servicerequestfiles/IVR_External_PortIn.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" soap:mustUnderstand="1">
			<wsse:UsernameToken
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="unt_dymtpxyv7NS1BCB4">
				<wsse:Username>webuser</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">t!n43p2b</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ns11:processPortRequest
			xmlns:ns11="http://b2b.tracfone.com/PortabilityServices"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns11:ProcessPortRequestType">
			<requestToken
				xmlns="http://www.tracfone.com/CommonTypes">
				<clientTransactionId>dpmpp10-2017102123652-12</clientTransactionId>
				<clientId>IVR_ExtPort</clientId>
			</requestToken>
			<ns2:brandName xmlns:ns2="http://www.tracfone.com/CommonTypes">@newBrand</ns2:brandName>
			<ns2:sourceSystem xmlns:ns2="http://www.tracfone.com/CommonTypes">IVR</ns2:sourceSystem> 
			<ns2:language
				xmlns:ns2="http://www.tracfone.com/CommonTypes">ENG</ns2:language>
			<ns11:currentSvcProviderInfo>
				<s78:min
					xmlns:s78="http://www.tracfone.com/ServiceProviderCommonTypes">@min</s78:min>
				<contactInfo
					xmlns="http://www.tracfone.com/ServiceProviderCommonTypes">
					<contactName>
						<ns2:firstName
							xmlns:ns2="http://www.tracfone.com/CommonTypes">noFirstName</ns2:firstName>
						<ns2:lastName
							xmlns:ns2="http://www.tracfone.com/CommonTypes">noLastName</ns2:lastName>
					</contactName>
					<contactPhoneNumber>2018888888</contactPhoneNumber>
					<address>
						<streetAddress
							xmlns="http://www.tracfone.com/CommonTypes">
							<line1>1295 CHARLESTON ROAD</line1>
						</streetAddress>
						<ns2:city xmlns:ns2="http://www.tracfone.com/CommonTypes">MOUNTAIN VIEW</ns2:city>
						<ns2:state
							xmlns:ns2="http://www.tracfone.com/CommonTypes">CA</ns2:state>
						<ns2:zipcode
							xmlns:ns2="http://www.tracfone.com/CommonTypes">94043</ns2:zipcode>
					</address>
					<email>@email</email>
				</contactInfo>
				<ns5:currentServiceProviderCarrier
					xmlns:ns5="http://www.tracfone.com/ServiceProviderCommonTypes">@oldBrand</ns5:currentServiceProviderCarrier>
				<ns5:accountNumber xmlns:ns5="http://www.tracfone.com/ServiceProviderCommonTypes">12345678</ns5:accountNumber>
				<ns5:accountPassword
					xmlns:ns5="http://www.tracfone.com/ServiceProviderCommonTypes">123456</ns5:accountPassword>
			</ns11:currentSvcProviderInfo>
			<ns11:zipCode>33178</ns11:zipCode>
			<ns11:targetEsn>@esn</ns11:targetEsn>
			<ns11:targetSim>@sim</ns11:targetSim>
			<ns11:pinCard>@pin</ns11:pinCard>
		</ns11:processPortRequest>
	</soapenv:Body>
</soapenv:Envelope>
